ejectorCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          5;
        startFace       535;
    }
    outlet
    {
        type            patch;
        nFaces          5;
        startFace       540;
    }
    upInWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       545;
    }
    lwInWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       570;
    }
    upOtWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       595;
    }
    lwOtWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25;
        startFace       620;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          620;
        startFace       645;
    }
)

// ************************************************************************* //
