ejectorCase/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (-30 -2.5 -0.5)
    (-30  2.5 -0.5)
    (-5   2.5 -0.5)
    (0    0.5 -0.5)
    (5    2.5 -0.5)
    (30   2.5 -0.5)
    (30  -2.5 -0.5)
    (5   -2.5 -0.5)
    (0   -0.5 -0.5)
    (-5  -2.5 -0.5)

    (-30 -2.5  0.5)
    (-30  2.5  0.5)
    (-5   2.5  0.5)
    (0    0.5  0.5)
    (5    2.5  0.5)
    (30   2.5  0.5)
    (30  -2.5  0.5)
    (5   -2.5  0.5)
    (0   -0.5  0.5)
    (-5  -2.5  0.5)

);



blocks
(
    hex (0 9 2 1 10 19 12 11)
    (25 5 1)
    simpleGrading (1 1 1)

    hex (9 7 4 2 19 17 14 12)
    (10 5 1)
    simpleGrading (1 1 1)

    hex (7 6 5 4 17 16 15 14)
    (25 5 1)
    siimpleGrading (1 1 1)
);

edges
(
    arc 2 4   (0  |-point-| -0.5)
    arc 7 9   (0 -|-point-| -0.5)
    arc 12 14 (0  |-point-|  0.5)
    arc 17 19 (0 -|-point-|  0.5)
);

boundary
(
    inlet
    {
    	type patch;
	faces
	(
	    (0 11 10 1)
	);
    }

    outlet
    {
    	type patch;
	faces
	(
	    (5 16 15 6)
	);
    }

    upInWall
    {
        type wall;
	faces
	(
	    (1 12 11 2)
	);
    }

    lwInWall
    {
        type wall;
	faces
	(
	    (0 19 9 10)
	);
    }

    upOtWall
    {
        type wall;
	faces
	(
	   (4 15 14 5)
	);
    }

    lwOtWall
    {
        type wall;
	faces
	(
	    (6 17 16 7)
	);
    }

//    ctUpWall
//    {
//       type wall;
//	faces
//	(
//	    (2 13 14 4)
//	    (3 14 13 4)
//	);
//    }
//
//    ctLwWall
//    {
//	type wall;
//	faces
//	(
//	    (7 18 17 8)
//	    (8 19 18 9)
//	);
//    }
);

mergePatchPairs
(
);

// ************************************************************************* //
